Core/src/src/Documents/РС_ЭлектроннаяНакладная/РС_ЭлектроннаяНакладная.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РС_ЭлектроннаяНакладная</name>
  <posting>Deny</posting>
  <registerRecords>AccountingRegister.AzRyХозрасчетныйUSD</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Водитель</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерУдостоверения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>13</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СерияУдостоверение</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>14</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВодительНеРезидент</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТранспортноеСредство</name>
    <type>
      <types>CatalogRef.ТранспортныеСредства</types>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ГосНомерАвтомобиля</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ГосНомерПрицепа</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ГрузоОтправитель</name>
    <type>
      <types>CatalogRef.Организации</types>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ГрузоПолучатель</name>
    <type>
      <types>CatalogRef.Организации</types>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>АдресДоставки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АдресОтправки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Отпустил</name>
    <type>
      <types>CatalogRef.КонтактныеЛица</types>
      <types>CatalogRef.ФизическиеЛица</types>
      <types>String</types>
      <types>CatalogRef.Сотрудники</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Получил</name>
    <type>
      <types>CatalogRef.КонтактныеЛица</types>
      <types>CatalogRef.ФизическиеЛица</types>
      <types>String</types>
      <types>CatalogRef.Сотрудники</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ID_ТН</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтатусТН</name>
    <type>
      <types>EnumRef.РС_СтатусыТН</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаТранспортировки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаАктивации</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаДоставкиТН</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидТранспортировки</name>
    <type>
      <types>EnumRef.РС_ВидыТранспортировки</types>
    </type>
  </attributes>
  <attributes>
    <name>КомментарийТН</name>
    <comment>(Общ) Любая дополнительная информация</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АсинхроннаяТН</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерТН</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипТН</name>
    <type>
      <types>EnumRef.РС_ТипыТН</types>
    </type>
  </attributes>
  <attributes>
    <name>Прицеп</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Перевозчик</name>
    <type>
      <types>CatalogRef.Организации</types>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаОплатыТранспортировки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РучнаяКорректировка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДругойТранспорт</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НакладнаяДистрибюций</name>
    <type>
      <types>DocumentRef.ПеремещениеЗапасов</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидЦены</name>
    <type>
      <types>CatalogRef.ВидыЦен</types>
    </type>
  </attributes>
  <attributes>
    <name>ПлательщикТранспортировкиТН</name>
    <type>
      <types>EnumRef.ПлательщикТранспортировкиТН</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭтоПодарок</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ДокументыОснования</name>
    <attributes>
      <name>ДокументОснование</name>
      <type>
        <types>DocumentRef.РасходнаяНакладная</types>
        <types>DocumentRef.ПеремещениеЗапасов</types>
        <types>DocumentRef.ПриходнаяНакладная</types>
        <types>DocumentRef.ПеремещениеВА</types>
        <types>DocumentRef.ЗаказПокупателя</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Партия</name>
      <type>
        <types>CatalogRef.ПартииНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>CatalogRef.КлассификаторЕдиницИзмерения</types>
        <types>CatalogRef.ЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>4</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтавкаНДС</name>
      <type>
        <types>CatalogRef.СтавкиНДС</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНДС</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НаименованиеДляРС</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Имущество</name>
      <type>
        <types>CatalogRef.ВнеоборотныеАктивы</types>
      </type>
    </attributes>
    <attributes>
      <name>ЭтоПодарок</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ТоварыЭлНакладных</name>
    <attributes>
      <name>ID</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>25</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>W_NAME</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>128</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>UNIT_ID</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>16</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>UNIT_TXT</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>QUANTITY</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>PRICE</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>4</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>AMOUNT</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>BAR_CODE</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>25</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>A_ID</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>VAT_TYPE</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>QUANTITY_EXT</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>STATUS</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ШапкаRS</name>
    <attributes>
      <name>ИмяПараметраRS</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>32</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначениеПараметраRS</name>
      <type>
        <types>Boolean</types>
        <types>String</types>
        <types>Date</types>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Core/src/src/AccumulationRegisters/Закупки/Закупки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>Закупки</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаНДС</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЗаказПоставщику</name>
    <type>
      <types>DocumentRef.ЗаказПоставщику</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Партия</name>
    <type>
      <types>CatalogRef.ПартииНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Документ</name>
    <type>
      <types>DocumentRef.РасходнаяНакладная</types>
      <types>DocumentRef.ПриходнаяНакладная</types>
      <types>DocumentRef.АвансовыйОтчет</types>
      <types>DocumentRef.ДополнительныеРасходы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СтавкаНДС</name>
    <type>
      <types>CatalogRef.СтавкиНДС</types>
    </type>
  </dimensions>
  <dimensions>
    <name>AzRyНаименованияПоставщиков</name>
    <type>
      <types>CatalogRef.AzRyНаименованияПоставщиков</types>
    </type>
  </dimensions>
  <dimensions>
    <name>AzRyШтрихкодыНоменклатуры</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Проект</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Core/src/src/Enums/ТипыНоменклатуры/ТипыНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыНоменклатуры</name>
  <enumValues>
    <name>Запас</name>
  </enumValues>
  <enumValues>
    <name>Услуга</name>
  </enumValues>
  <enumValues>
    <name>Работа</name>
  </enumValues>
  <enumValues>
    <name>Операция</name>
  </enumValues>
  <enumValues>
    <name>ВидРабот</name>
  </enumValues>
  <enumValues>
    <name>AzRyРасход</name>
  </enumValues>
  <enumValues>
    <name>Лицензия</name>
  </enumValues>
</mdclass:Enum>

Core/src/src/Documents/РС_ЭлектроннаяНакладная/Forms/ФормаДокумента/Module.bsl
&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
		
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
	
КонецПроцедуры


&НаСервере
Процедура УстановитьВидимостьИДоступность()
	
	Элементы.ГруппаОбщееДеталная.Видимость	= ЗначениеЗаполнено(Объект.ТипТН);
	Элементы.ГруппаДистрибуция.Видимость	= Объект.ТипТН = Перечисления.РС_ТипыТН.ПодчиненнаяТН;
	Элементы.ВидЦены.Видимость				= Объект.ТипТН = Перечисления.РС_ТипыТН.Дистрибуция;
	
	
	пБезТранспортировки = (Объект.ТипТН = Перечисления.РС_ТипыТН.РеализацияБезТранспортировки);
	Элементы.АдресДоставки.Видимость		= НЕ пБезТранспортировки;
	Элементы.ГруппаПеревозчика.Видимость	= НЕ пБезТранспортировки И Объект.ВидТранспортировки = Перечисления.РС_ВидыТранспортировки.Перегрузчик_Автомобильная;
	Элементы.ДругойТранспорт.Видимость 		= НЕ пБезТранспортировки И Объект.ВидТранспортировки = Перечисления.РС_ВидыТранспортировки.Прочее;
	
	Если Объект.ТипТН = Перечисления.РС_ТипыТН.РеализацияСТранспортировкой ИЛИ Объект.ТипТН = Перечисления.РС_ТипыТН.ВозвратОтПокупателя Тогда
		Элементы.ЗатратаТранспортировки.Видимость = Объект.ВидТранспортировки = Перечисления.РС_ВидыТранспортировки.Автомобильная ИЛИ
													Объект.ВидТранспортировки = Перечисления.РС_ВидыТранспортировки.Автомобильная_Заграничная ИЛИ
													Объект.ВидТранспортировки = Перечисления.РС_ВидыТранспортировки.Перегрузчик_Автомобильная;
	Иначе
		Элементы.ЗатратаТранспортировки.Видимость = Ложь;
	КонецЕсли;
	Если ЭтаПеремещениеВА Тогда
		Элементы.ТоварыИмущество.Видимость		= Истина;
		Элементы.ТоварыНоменклатура.Видимость	= Ложь;
		Элементы.ТоварыХарактеристика.Видимость = Ложь;
	Иначе
		Элементы.ТоварыИмущество.Видимость		= Ложь;
		Элементы.ТоварыНоменклатура.Видимость	= Истина;
		Элементы.ТоварыХарактеристика.Видимость = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// СтандартныеПодсистемы.Печать
	УправлениеПечатью.ПриСозданииНаСервере(ЭтотОбъект, Элементы.ПодменюПечать);
	// Конец СтандартныеПодсистемы.Печать
	УправлениеНебольшойФирмойСервер.УстановитьОтображаниеПодменюПечати(Элементы.ПодменюПечать);
	
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) И Параметры.Свойство("ДокументыОснования") Тогда
		
		Для Каждого ДокументОснование Из Параметры.ДокументыОснования Цикл
			НоваяСтрока = Объект.ДокументыОснования.Добавить();
			НоваяСтрока.ДокументОснование = ДокументОснование;
		КонецЦикла;
		Если Параметры.Свойство("НакладнаяДистрибюций") Тогда 
			Объект.НакладнаяДистрибюций = Параметры.НакладнаяДистрибюций;
			СсылкаЭН = Параметры.СсылкаЭН;
			Объект.ТранспортноеСредство	= СсылкаЭН.ТранспортноеСредство;
			Объект.ГосНомерАвтомобиля	= СсылкаЭН.ГосНомерАвтомобиля;
			Объект.Водитель				= СсылкаЭН.Водитель;
			Объект.НомерУдостоверения	= СсылкаЭН.НомерУдостоверения;
			Объект.ДругойТранспорт      = СсылкаЭН.ДругойТранспорт;
		КонецЕсли;
		ЗапольнитьРеквизитиНакладной(Параметры.ДокументыОснования);
	КонецЕсли;
	СписокДокументыОснования.ЗагрузитьЗначения(Объект.ДокументыОснования.Выгрузить().ВыгрузитьКолонку("ДокументОснование"));
	УстановитьПараметрыВыбора_ТипТН(Истина);	
	УстановитьВидимостьИДоступность();
	
	ЗаполнитьИНН_ПеревозчикаГрузоотправителяГрузополучателя(ИННГрузополучателя, 	Объект.ГрузоПолучатель); //ГрузоПолучатель
	ЗаполнитьИНН_ПеревозчикаГрузоотправителяГрузополучателя(ИННГрузоотправителя, 	Объект.ГрузоОтправитель);//ГрузоОтправитель
	ЗаполнитьИНН_ПеревозчикаГрузоотправителяГрузополучателя(ИННПеревозчика, 		Объект.Перевозчик);      //Перевозчик
	
	ВидТранспортировкиПриИзмененииНаСервере();// Kuzmich, 16.05.2022. ПлательщикТранспортировкиТН по-умолчанию
	УстановкаФорматовЦен();	
КонецПроцедуры

&НаКлиенте
Процедура ТипТНПриИзменении(Элемент)
	УстановитьВидимостьИДоступность();
	Если Объект.ТипТН = ПредопределенноеЗначение("Перечисление.РС_ТипыТН.Дистрибуция") Тогда
		Если НЕ ЗначениеЗаполнено(Объект.ВидЦены) Тогда
			Объект.ВидЦены = УправлениеНебольшойФирмойПовтИсп.ПолучитьПредопределенноеЗначениеСправочника("ВидыЦен", "Оптовая");
		КонецЕсли;
		ЗаполнитьЦеныПоДистрибюции();
	ИначеЕсли Объект.ТипТН = ПредопределенноеЗначение("Перечисление.РС_ТипыТН.РеализацияБезТранспортировки") Тогда
		Объект.АдресДоставки		= "";
		Объект.ВидТранспортировки	= Неопределено;
		//Объект.ДругойТранспорт		= "";
		Объект.Перевозчик			= Неопределено;
		ИННПеревозчика				= "";
		Объект.НомерУдостоверения	= "";
		Объект.Водитель				= "";
		Объект.ТранспортноеСредство = "";
		Объект.ГосНомерАвтомобиля	= "";
		Объект.Прицеп               = "";
	КонецЕсли;
КонецПроцедуры
 
 
 //<Запольнить Реквизити Накладной>
 //Запольняется таб часть
 &НаСервере
 Процедура ЗапольнитьРеквизитиНакладной(МассивДокументовОснования)
	 
	 //ЗапольнитьЗначенияШапки();
	 Если Объект.ТипТН = Перечисления.РС_ТипыТН.ВозвратОтПокупателя Тогда
		 Объект.Товары.Загрузить(ИнтеграцияСНалоговойСлужбой_И_БухгалтерскийУчет.СформироватьТаблицуВозврата(МассивДокументовОснования));
	 ИначеЕсли Объект.ТипТН = Перечисления.РС_ТипыТН.ВнутреннееПеремещение ИЛИ Объект.ТипТН = Перечисления.РС_ТипыТН.Дистрибуция Тогда
		 Объект.Товары.Загрузить(ИнтеграцияСНалоговойСлужбой_И_БухгалтерскийУчет.СформироватьТаблицуПеремешения(МассивДокументовОснования));
		Если Объект.ТипТН = Перечисления.РС_ТипыТН.Дистрибуция Тогда
			Объект.ВидЦены = УправлениеНебольшойФирмойПовтИсп.ПолучитьПредопределенноеЗначениеСправочника("ВидыЦен", "Оптовая");
			ЗаполнитьЦеныПоДистрибюции();
		КонецЕсли;
		//--------------------------------------------------------------------------
		// © Шишка В.В. [18 сентября 2023]  НАЧАЛО
		УстановитьЦенуЗакупкиВСтрокеЗапасы();	
		// © Шишка В.В. [18 сентября 2023]  КОНЕЦ
		//--------------------------------------------------------------------------
		
	Иначе
		//Объект.Товары.Загрузить(ИнтеграцияСНалоговойСлужбой_И_БухгалтерскийУчет.СформироватьТаблицуРеализации(МассивДокументовОснования));
		// Олег Литвиненко 30.08.22 --->
		ТаблицаТовары = ИнтеграцияСНалоговойСлужбой_И_БухгалтерскийУчет.СформироватьТаблицуРеализации(МассивДокументовОснования);
		Если ТаблицаТовары.Найти(Истина, "ЭтоПодарок") <> Неопределено Тогда
			Объект.Комментарий = "უსასყიდლო რეალიზაცია";
			Объект.КомментарийТН = Объект.Комментарий;
		КонецЕсли;
		Объект.Товары.Загрузить(ТаблицаТовары);
		// Олег Литвиненко <---
	 КонецЕсли;
	 //Записать();Паганини
	 
	// УдалитьУслугиИзТаблицы();//Паганини#OneSoft: Перенес в условие, где заполняется таблица
	
	Если ТипЗнч(Объект.ГрузоПолучатель)= Тип("СправочникСсылка.Контрагенты")и Объект.ГрузоПолучатель.ПересчитатьКоличество Тогда 
		Документы.РС_ЭлектроннаяНакладная.ПересчитатьКоличествоИзДополнительнойЕдиницыИзмеренияВОсновнуюЕдиницуИзмерения(Объект.Товары);	
	КонецЕсли;
	 
	 ДокументОбъект = РеквизитФормыВЗначение("Объект");
	 ДокументОбъект.СформироватьТаблицуЭлНакладных();
	 ДокументОбъект.СформироватьТаблицуШапкаRS();
	 ЗначениеВРеквизитФормы(ДокументОбъект,"Объект");
	 Записать();//Паганини
 
 КонецПроцедуры // ()

 Процедура УдалитьУслугиИзТаблицы() 
	
	Для Каждого Стр Из Объект.Товары Цикл 
		Если Стр.Номенклатура.ТипНоменклатуры <> Перечисления.ТипыНоменклатуры.Запас Тогда
			Объект.Товары.Удалить(Стр);
		КонецЕсли;
	КонецЦикла;	
	
КонецПроцедуры	

&НаСервере
Процедура ЗаполнитьТоварыНаСервере()
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) ИЛИ Модифицированность Тогда
		Записать();
	КонецЕсли;

	Объект.Товары.Очистить(); 
	ЗапольнитьРеквизитиНакладной(Объект.ДокументыОснования.Выгрузить().ВыгрузитьКолонку("ДокументОснование"));
	
КонецПроцедуры


&НаКлиенте
Процедура ЗаполнитьТовары(Команда)
	
	Если Объект.Товары.Количество() > 0 Тогда 
		Режим = РежимДиалогаВопрос.ДаНет;
		ТекстВопроса = Нстр("ka='შევსებამდე გასუფთავდება არსებული საქონლის ცხრილი. გაგრძელდეს?';ru='Перед заполнением очистится табличная часть Товары. Продолжить?';en='Before filling cleared tabular section Goods. Proceed?'");
		
		Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопроса", ЭтаФорма, Параметры);
		ПоказатьВопрос(Оповещение, ТекстВопроса, Режим, 0);
	Иначе 
		ЗаполнитьТоварыНаСервере();
		ОбновитьПодвалФормы();
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытияВопроса(Результат, Параметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Нет Тогда
		Возврат;
	Иначе 
		ЗаполнитьТоварыНаСервере();
		ОбновитьПодвалФормы();
	КонецЕсли;

КонецПроцедуры


&НаКлиенте
Процедура ГрузоотправительПриИзменении(Элемент)
	ЗаполнитьИНН_ПеревозчикаГрузоотправителяГрузополучателя(ИННГрузоотправителя, Объект.ГрузоОтправитель);
КонецПроцедуры

&НаКлиенте
Процедура ГрузополучательПриИзменении(Элемент)
	ЗаполнитьИНН_ПеревозчикаГрузоотправителяГрузополучателя(ИННГрузополучателя, Объект.ГрузоПолучатель);
КонецПроцедуры

&НаКлиенте
Процедура ТранспортноеСредствоПриИзменении(Элемент)
	ТранспортноеСредствоПриИзмененииНаСервере();

	КонецПроцедуры

&НаСервере
Процедура ТранспортноеСредствоПриИзмененииНаСервере()
	
	//Lazare_
	Если Объект.ТранспортноеСредство = ПредопределенноеЗначение("Справочник.ТранспортныеСредства.ОбщественныйТранспорт") Тогда 
		Возврат ;	 
	КонецЕсли;
	//_Lazare	
		
	Если ТипЗнч(Объект.ТранспортноеСредство) = Тип("СправочникСсылка.ТранспортныеСредства") Тогда
		Объект.ГосНомерАвтомобиля = Объект.ТранспортноеСредство.Код;
		ОсновнойВодитель = Объект.ТранспортноеСредство.ОсновнойВодитель;
		Если ЗначениеЗаполнено(ОсновнойВодитель) Тогда
			Если НЕ ЗначениеЗаполнено(Объект.Водитель) Тогда
				Объект.Водитель 			= ОсновнойВодитель;
				Объект.НомерУдостоверения 	= ОсновнойВодитель.ИНН;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВодительПриИзменении(Элемент)
	ВодительПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ВодительПриИзмененииНаСервере()
	
	Объект.НомерУдостоверения = Объект.Водитель.ИНН;
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьТН(Команда) Экспорт 
	ОбновитьДанныеОтправкиНаСервере();	
	Операция_ЭлНакладная(Команда.Имя);
	Прочитать();
	
КонецПроцедуры


&НаКлиенте
Процедура Операция_ЭлНакладная(КомандаТН)
	
	// Олег Литвиненко 03.11.22 --->
	Если КомандаТН = "АктивироватьТН" Или КомандаТН = "СоздатьИАктивироватьТН" Тогда
		Если Не ПроверитьПроведениеОснований() Тогда
			Возврат;
		КонецЕсли;
	КонецЕсли;
	// Олег Литвиненко <---
	
	ОчиститьСообщения();//Паганини
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) ИЛИ Модифицированность Тогда
		Записать(Новый Структура("РежимЗаписи", РежимЗаписиДокумента.Запись));
		Если Не Объект.РучнаяКорректировка Тогда 
			ОбновитьДанныеОтправкиНаСервере();
			Записать(Новый Структура("РежимЗаписи", РежимЗаписиДокумента.Запись));
		КонецЕсли; 
	КонецЕсли;
	
	Результат = ИнтеграцияСНалоговойСлужбой_И_БухгалтерскийУчет.ОбработатьОперациюТН(КомандаТН, Объект);
	Если Не Результат = 0 Тогда 
		Сообщить(Результат);
	КонецЕсли;

КонецПроцедуры

// Олег Литвиненко 03.11.22 --->
&НаСервере
Функция ПроверитьПроведениеОснований()
	Возврат Документы.РС_ЭлектроннаяНакладная.ПроверитьПроведениеОснований(Объект.Ссылка);
КонецФункции// Олег Литвиненко <---

&НаСервере
Функция ПолучитьСтруктуруЭлНакладных()
	
	Возврат Документы.РС_ЭлектроннаяНакладная.ПолучитьСтруктуруЭлНакладных(Объект.Ссылка);
	
КонецФункции

&НаСервере
Процедура ОбновитьДанныеОтправкиНаСервере()
	
	ДокументОбъект = РеквизитФормыВЗначение("Объект");
	//Lazare_
	Если Не ПустаяСтрока(ДокументОбъект.ТранспортноеСредство)и ДокументОбъект.ТранспортноеСредство = ПредопределенноеЗначение("Справочник.ТранспортныеСредства.ОбщественныйТранспорт")Тогда 
		ДокументОбъект.ГосНомерАвтомобиля = ДокументОбъект.ТранспортноеСредство.Наименование ;
	КонецЕсли ;	
	//_Lazare	
	ДокументОбъект.СформироватьТаблицуЭлНакладных();
	ДокументОбъект.СформироватьТаблицуШапкаRS();
	ЗначениеВРеквизитФормы(ДокументОбъект,"Объект");
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьДанныеОтправки(Команда)
	ОбновитьДанныеОтправкиНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСтатусТН(Команда) Экспорт
	ОбновитьДанныеОтправкиНаСервере();
	Если ЗначениеЗаполнено(Объект.ID_ТН) Тогда
		Операция_ЭлНакладная(Команда.Имя);
		Прочитать();
	КонецЕсли;
КонецПроцедуры


&НаКлиенте
Процедура РедактироватьИД(Команда)
	Элементы.ID_ТН.ТолькоПросмотр = Ложь;	
КонецПроцедуры

&НаКлиенте
Процедура АктивироватьТН(Команда) Экспорт
	ОбновитьДанныеОтправкиНаСервере();
	Операция_ЭлНакладная(Команда.Имя);
	Прочитать();
КонецПроцедуры

&НаКлиенте
Процедура ЗавершитьТН(Команда) Экспорт
	ОбновитьДанныеОтправкиНаСервере();
	Операция_ЭлНакладная(Команда.Имя);
	Прочитать();
КонецПроцедуры

&НаКлиенте
Процедура ОтменитьТН(Команда) Экспорт
	
	Режим = РежимДиалогаВопрос.ДаНет;
	Ответ = Вопрос(НСтр("ru = 'Вы уверены что хотите отменить ТН?';"
	+ " ka = 'დარწმუნებული ხართ რომ გნებავთ ზედნადების გაუქმება?'"), Режим, 0);
	Если Ответ <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	// Олег Литвиненко 22.11.22 --->
	МассивСФ = НайтиСвязанныеСчетаФактуры();
	Если МассивСФ.Количество() Тогда
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Нстр("ka='ყურადღება!!! ვინაიდან არჩეული ზედნადები უკვე მიბმულია საგადასახადო ა/ფაქტურაზე , მისი წაშლა შეუძლებელია. 
			|წასაშლელად საჭიროა  ა/ფაქტურის რეესტრიდან მოხსნა.რეესტრიდან მოსახსნელი ა/ფაქტურა/ები:';ru='Внимание!!! Поскольку выбранный счет-фактура уже связан с налоговым счетом-фактурой, его нельзя удалить. 
			|Для удаления необходимо удалить счет-фактуру из реестра.Счета-фактуры, подлежащие удалению из реестра:'"));
		
		Для Каждого СФ Из МассивСФ Цикл
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Строка(СФ), СФ);
		КонецЦикла;
		
		Возврат;
		
	КонецЕсли;
	// Олег Литвиненко <---
	
	ОбновитьДанныеОтправкиНаСервере();
	Операция_ЭлНакладная(Команда.Имя);
	Прочитать();
КонецПроцедуры

&НаКлиенте
Процедура СоздатьИАктивироватьТН(Команда) Экспорт
	ОбновитьДанныеОтправкиНаСервере();
	Операция_ЭлНакладная(Команда.Имя);
	Прочитать();
КонецПроцедуры

//Паганини
&НаКлиенте
Процедура ТоварыКоличествоПриИзменении(Элемент)
	ТекДанные = Элементы.Товары.ТекущиеДанные;
	СтавкаНДС = ПолучитьЗначенияРеквизита(ТекДанные.СтавкаНДС, "Ставка");
	ТекДанные.Сумма 	= ТекДанные.Количество	* ТекДанные.Цена;
	ТекДанные.СуммаНДС	= Окр(ТекДанные.Сумма	* СтавкаНДС/(100 + СтавкаНДС), 2);
КонецПроцедуры

&НаКлиенте
Процедура ТоварыЦенаПриИзменении(Элемент)
	ТекДанные = Элементы.Товары.ТекущиеДанные;
	СтавкаНДС = ПолучитьЗначенияРеквизита(ТекДанные.СтавкаНДС, "Ставка");
	ТекДанные.Сумма 	= ТекДанные.Количество	* ТекДанные.Цена;
	ТекДанные.СуммаНДС	= Окр(ТекДанные.Сумма	* СтавкаНДС/(100 + СтавкаНДС), 2);
КонецПроцедуры

&НаКлиенте
Процедура ТоварыСуммаПриИзменении(Элемент)
	ТекДанные = Элементы.Товары.ТекущиеДанные;
	СтавкаНДС = ПолучитьЗначенияРеквизита(ТекДанные.СтавкаНДС, "Ставка");
	ТекДанные.Цена 	= ?(ТекДанные.Количество = 0, 0, Окр(ТекДанные.Сумма / ТекДанные.Количество, 2));
	ТекДанные.СуммаНДС	= Окр(ТекДанные.Сумма	* СтавкаНДС/(100 + СтавкаНДС), 2);
КонецПроцедуры

&НаКлиенте
Процедура ТоварыСтавкаНДСПриИзменении(Элемент)
	ТекДанные = Элементы.Товары.ТекущиеДанные;
	СтавкаНДС = ПолучитьЗначенияРеквизита(ТекДанные.СтавкаНДС, "Ставка");
	ТекДанные.СуммаНДС	= Окр(ТекДанные.Сумма	* СтавкаНДС/(100 + СтавкаНДС), 2);
КонецПроцедуры



&НаКлиенте
Процедура ТоварыНоменклатураПриИзменении(Элемент)
	ТекДанные = Элементы.Товары.ТекущиеДанные;
	ТекДанные.ЕдиницаИзмерения 	= ПолучитьЗначенияРеквизита(ТекДанные.Номенклатура, "ЕдиницаИзмерения");
	ТекДанные.СтавкаНДС 		= ПолучитьЗначенияРеквизита(ТекДанные.Номенклатура, "СтавкаНДС");
	СтавкаНДС = ПолучитьЗначенияРеквизита(ТекДанные.СтавкаНДС, "Ставка");
	ТекДанные.СуммаНДС	= Окр(ТекДанные.Сумма	* СтавкаНДС/(100 + СтавкаНДС), 2);
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьЗначенияРеквизита(Ссылка, ИмяРеквизита)
	Возврат Ссылка[ИмяРеквизита];
КонецФункции

&НаКлиенте
Процедура ВидТранспортировкиПриИзменении(Элемент)
	ВидТранспортировкиПриИзмененииНаСервере();// Kuzmich, 16.05.2022. ПлательщикТранспортировкиТН по-умолчанию
	УстановитьВидимостьИДоступность();
КонецПроцедуры

&НаСервере
Процедура ВидТранспортировкиПриИзмененииНаСервере()
	// Kuzmich, 17.05.2022. ПлательщикТранспортировкиТН по-умолчанию
	Если Константы.ПлательщикТранспортировкиТН_в_Организации.Получить() Тогда
		
		Если Объект.ТипТН = Перечисления.РС_ТипыТН.РеализацияСТранспортировкой ИЛИ Объект.ТипТН = Перечисления.РС_ТипыТН.ВозвратОтПокупателя Тогда
			Если Объект.ВидТранспортировки = Перечисления.РС_ВидыТранспортировки.Автомобильная
				ИЛИ Объект.ВидТранспортировки = Перечисления.РС_ВидыТранспортировки.Автомобильная_Заграничная
				ИЛИ	Объект.ВидТранспортировки = Перечисления.РС_ВидыТранспортировки.Перегрузчик_Автомобильная
				Тогда
				Если ЗначениеЗаполнено(Объект.Организация) Тогда
					Объект.ПлательщикТранспортировкиТН = Объект.Организация.ПлательщикТранспортировкиТН;
				Иначе
					Объект.ПлательщикТранспортировкиТН = Перечисления.ПлательщикТранспортировкиТН.ПустаяСсылка();
				КонецЕсли;
			Иначе
				Объект.ПлательщикТранспортировкиТН = Перечисления.ПлательщикТранспортировкиТН.ПустаяСсылка();
			КонецЕсли;
		КонецЕсли;	
		
	КонецЕсли;
	// Kuzmich, 17.05.2022. ПлательщикТранспортировкиТН по-умолчанию
КонецПроцедуры

&НаКлиенте
Процедура ПеревозчикПриИзменении(Элемент)
	ЗаполнитьИНН_ПеревозчикаГрузоотправителяГрузополучателя(ИННПеревозчика, Объект.Перевозчик);
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ЗаполнитьИНН_ПеревозчикаГрузоотправителяГрузополучателя(ПолеИНН, Контрагент)
	Если ЗначениеЗаполнено(Контрагент) Тогда
		ПолеИНН = Контрагент.ИНН;
	Иначе
		ПолеИНН = "";
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ВидЦеныПриИзменении(Элемент)
	ЗаполнитьЦеныПоДистрибюции();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьЦеныПоДистрибюции()
	Если Константы.ЦенаИСуммаВПеремешении.Получить() Тогда
		Возврат;
	КонецЕсли;	
	Для Каждого СтрокаТЧ Из Объект.Товары Цикл 
		РС_ОбщегоНазначения.ЗаполнитьЦену(СтрокаТЧ, Объект.ВидЦены);
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура УстановитьПараметрыВыбора_ТипТН(ПриОткрытии = Ложь)
	
	ЭтаПеремещениеВА = Ложь;
	Если СписокДокументыОснования.Количество() = 0 Тогда
		Объект.ДокументыОснования.Очистить();
		Возврат;
	КонецЕсли;
	ТипЗнченияДокумента = ТипЗнч(СписокДокументыОснования[0].Значение);
	ЭтаПеремещениеВА	= (ТипЗнченияДокумента = Тип("ДокументСсылка.ПеремещениеВА"));
	
	Если СписокДокументыОснования[0].Значение <> Неопределено Тогда
		Попытка
			ВидОперации = СписокДокументыОснования[0].Значение.ВидОперации;
		Исключение
		КонецПопытки;
	КонецЕсли;	
	
	Массив_ТипТН = Новый Массив;
	Если ТипЗнченияДокумента = Тип("ДокументСсылка.ПеремещениеЗапасов") Тогда
		Массив_ТипТН.Добавить(ПредопределенноеЗначение("Перечисление.РС_ТипыТН.ВнутреннееПеремещение"));
		Массив_ТипТН.Добавить(ПредопределенноеЗначение("Перечисление.РС_ТипыТН.Дистрибуция"));
	ИначеЕсли ТипЗнченияДокумента = Тип("ДокументСсылка.ПриходнаяНакладная") Тогда
		Массив_ТипТН.Добавить(ПредопределенноеЗначение("Перечисление.РС_ТипыТН.ВозвратОтПокупателя"));
	ИначеЕсли ЭтаПеремещениеВА Тогда
		Массив_ТипТН.Добавить(ПредопределенноеЗначение("Перечисление.РС_ТипыТН.ВнутреннееПеремещение"));
	Иначе
		Массив_ТипТН.Добавить(ПредопределенноеЗначение("Перечисление.РС_ТипыТН.ПодчиненнаяТН"));
		Массив_ТипТН.Добавить(ПредопределенноеЗначение("Перечисление.РС_ТипыТН.РеализацияБезТранспортировки"));
		Массив_ТипТН.Добавить(ПредопределенноеЗначение("Перечисление.РС_ТипыТН.РеализацияСТранспортировкой"));
		Если ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийРасходнаяНакладная.ПередачаВПереработку") Тогда
			Массив_ТипТН.Добавить(ПредопределенноеЗначение("Перечисление.РС_ТипыТН.ВнутреннееПеремещение"));
		КонецЕсли;				
	КонецЕсли;
	
	Элементы.ТипТН.СписокВыбора.ЗагрузитьЗначения(Массив_ТипТН);
	
	Если НЕ ПриОткрытии И Массив_ТипТН.Найти(Объект.ТипТН) = Неопределено Тогда
		Если ТипЗнченияДокумента = Тип("ДокументСсылка.ПеремещениеЗапасов") ИЛИ
			 ТипЗнченияДокумента = Тип("ДокументСсылка.ПеремещениеВА") Тогда
			Объект.ТипТН = ПредопределенноеЗначение("Перечисление.РС_ТипыТН.ВнутреннееПеремещение");
		ИначеЕсли ТипЗнченияДокумента = Тип("ДокументСсылка.ЗаказПокупателя") Тогда	
			Объект.ТипТН = ПредопределенноеЗначение("Перечисление.РС_ТипыТН.РеализацияСТранспортировкой");	
		ИначеЕсли ТипЗнченияДокумента = Тип("ДокументСсылка.ПриходнаяНакладная") Тогда
			Объект.ТипТН = ПредопределенноеЗначение("Перечисление.РС_ТипыТН.ВозвратОтПокупателя");
		Иначе
			Объект.ТипТН = ПредопределенноеЗначение("Перечисление.РС_ТипыТН.РеализацияСТранспортировкой");
			Если ВидОперации = Перечисления.ВидыОперацийРасходнаяНакладная.ПередачаВПереработку Тогда
				Объект.ТипТН = ПредопределенноеЗначение("Перечисление.РС_ТипыТН.ВнутреннееПеремещение");
			КонецЕсли;
		КонецЕсли;
		УстановитьВидимостьИДоступность();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокДокументыОснованияПриИзменении(Элемент)
	УстановитьПараметрыВыбора_ТипТН();
	Модифицированность = Истина;
КонецПроцедуры

#Область ОбработчикиБиблиотек
// СтандартныеПодсистемы.Печать
&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуПечати(Команда)
	УправлениеПечатьюКлиент.ВыполнитьПодключаемуюКомандуПечати(Команда, ЭтотОбъект, Объект);
	// УНФ
	СтатистикаИспользованияФормКлиент.ДобавитьСтатистикуКомандПечати(ЭтотОбъект, Команда);
	// Конец УНФ
КонецПроцедуры
// Конец СтандартныеПодсистемы.Печать

#КонецОбласти

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	Объект.ДокументыОснования.Очистить();
	Для Каждого ЗнДокумента ИЗ СписокДокументыОснования Цикл
		НоваяСтрока = Объект.ДокументыОснования.Добавить();
		НоваяСтрока.ДокументОснование = ЗнДокумента.Значение;
	КонецЦикла;
	РС_ОбщегоНазначенияКлиент.ПроверкаМодифицированостиВопрос(Объект.Ссылка, Модифицированность, Отказ);//Паганини
	Объект.СуммаДокумента = Объект.Товары.Итог("Сумма");
КонецПроцедуры

&НаКлиенте
Процедура ОтправитьПеревозчику(Команда)
	ОбновитьДанныеОтправкиНаСервере();
	Операция_ЭлНакладная(Команда.Имя);
	Прочитать();
КонецПроцедуры

// Олег Литвиненко 22.11.22 --->
&НаСервере
Функция НайтиСвязанныеСчетаФактуры()
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	СчетФактураОтправленныйГрузияДокументыОснования.Ссылка КАК Ссылка
	               |ИЗ
	               |	Документ.СчетФактураОтправленныйГрузия.ДокументыОснования КАК СчетФактураОтправленныйГрузияДокументыОснования
	               |ГДЕ
	               |	СчетФактураОтправленныйГрузияДокументыОснования.ДокументОснование В(&МассивДокументов)
	               |	И НЕ СчетФактураОтправленныйГрузияДокументыОснования.Ссылка.ПометкаУдаления";
	Запрос.УстановитьПараметр("МассивДокументов", Объект.ДокументыОснования.Выгрузить().ВыгрузитьКолонку("ДокументОснование"));
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат ?(РезультатЗапроса.Пустой(), Новый Массив, РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("Ссылка"));
	
КонецФункции// Олег Литвиненко <---

// Олег Литвиненко 28.11.22 --->
&НаКлиенте
Процедура ОбновитьПодвалФормы()
	
	ИтогВсего = Объект.Товары.Итог("Сумма");
	ИтогСуммаНДС = Объект.Товары.Итог("СуммаНДС");

КонецПроцедуры// Олег Литвиненко <---

// Олег Литвиненко 28.11.22 --->
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ОбновитьПодвалФормы();
	
КонецПроцедуры// Олег Литвиненко <---

// Олег Литвиненко 28.11.22 --->
&НаКлиенте
Процедура ТоварыПриИзменении(Элемент)
	
	ОбновитьПодвалФормы();
	
КонецПроцедуры // Олег Литвиненко <---

//--------------------------------------------------------------------------
// © Шишка В.В. [18 сентября 2023]  НАЧАЛО
&НаСервере
Процедура УстановитьЦенуЗакупкиВСтрокеЗапасы()

	Если НЕ ПолучитьФункциональнуюОпцию("ВыводЦеныПоследнейЗакупкиВДокументеПеремещениеЗапасов")
		Или Объект.ДокументыОснования.Количество() <> 1
		ИЛИ ТипЗнч(Объект.ДокументыОснования[0].ДокументОснование) <> Тип("ДокументСсылка.ПеремещениеЗапасов")
		Тогда
	
		Возврат;	
	
	КонецЕсли;
	ДокументОснование = Объект.ДокументыОснования[0].ДокументОснование;
	
	ТаблицаЗапасы = Объект.Товары.Выгрузить(); 

	ДатаКонтроля =   ?(НачалоДня(ДокументОснование.Дата) = НачалоДня(ТекущаяДатаСеанса()), КонецДня(ТекущаяДатаСеанса()), ДокументОснование.Дата);
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Организация", Объект.Организация);
	Запрос.УстановитьПараметр("Запасы", ТаблицаЗапасы);
	Запрос.УстановитьПараметр("КонецПериода", Новый Граница(ДатаКонтроля, ВидГраницы.Исключая));
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Запасы.Номенклатура КАК Номенклатура,
	|	Запасы.Характеристика КАК Характеристика,
	|	Запасы.НомерСтроки КАК НомерСтроки
	|ПОМЕСТИТЬ ВТ_Запасы
	|ИЗ
	|	&Запасы КАК Запасы
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура,
	|	Характеристика
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗакупкиОбороты.Период КАК Период,
	|	ЗакупкиОбороты.Номенклатура КАК Номенклатура,
	|	ЗакупкиОбороты.Характеристика КАК Характеристика,
	|	ЗакупкиОбороты.СуммаОборот КАК Сумма,
	|	ЗакупкиОбороты.КоличествоОборот КАК Количество
	|ПОМЕСТИТЬ ВТ_Закупки
	|ИЗ
	|	РегистрНакопления.Закупки.Обороты(
	|			,
	|			&КонецПериода,
	|			Регистратор,
	|			Организация = &Организация
	|				И (Номенклатура, Характеристика) В
	|					(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|						ВТ_Запасы.Номенклатура КАК Номенклатура,
	|						ВТ_Запасы.Характеристика КАК Характеристика
	|					ИЗ
	|						ВТ_Запасы КАК ВТ_Запасы)) КАК ЗакупкиОбороты
	|ГДЕ
	|	ЗакупкиОбороты.Регистратор ССЫЛКА Документ.ПриходнаяНакладная
	|	И ЗакупкиОбороты.КоличествоОборот > 0
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Период,
	|	Номенклатура,
	|	Характеристика
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МАКСИМУМ(ВТ_Закупки.Период) КАК Период,
	|	ВТ_Закупки.Номенклатура КАК Номенклатура,
	|	ВТ_Закупки.Характеристика КАК Характеристика
	|ПОМЕСТИТЬ ВТ_ЗакупкиАктуальные
	|ИЗ
	|	ВТ_Закупки КАК ВТ_Закупки
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_Закупки.Номенклатура,
	|	ВТ_Закупки.Характеристика
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Период,
	|	Номенклатура,
	|	Характеристика
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ЗакупкиАктуальные.Номенклатура КАК Номенклатура,
	|	ВТ_ЗакупкиАктуальные.Характеристика КАК Характеристика,
	|	ВТ_Закупки.Сумма / ВТ_Закупки.Количество КАК ЦенаЗакупки
	|ПОМЕСТИТЬ ВТ_ЦеныЗакупки
	|ИЗ
	|	ВТ_ЗакупкиАктуальные КАК ВТ_ЗакупкиАктуальные
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_Закупки КАК ВТ_Закупки
	|		ПО ВТ_ЗакупкиАктуальные.Период = ВТ_Закупки.Период
	|			И ВТ_ЗакупкиАктуальные.Номенклатура = ВТ_Закупки.Номенклатура
	|			И ВТ_ЗакупкиАктуальные.Характеристика = ВТ_Закупки.Характеристика
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура,
	|	Характеристика
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Запасы.НомерСтроки КАК НомерСтроки,
	|	ВТ_ЦеныЗакупки.ЦенаЗакупки КАК ЦенаЗакупки
	|ИЗ
	|	ВТ_Запасы КАК ВТ_Запасы
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ЦеныЗакупки КАК ВТ_ЦеныЗакупки
	|		ПО ВТ_Запасы.Номенклатура = ВТ_ЦеныЗакупки.Номенклатура
	|			И ВТ_Запасы.Характеристика = ВТ_ЦеныЗакупки.Характеристика";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		ТекДанные = Объект.Товары[Выборка.НомерСтроки - 1];
		ТекДанные.Цена = Выборка.ЦенаЗакупки;
		СтавкаНДС = ПолучитьЗначенияРеквизита(ТекДанные.СтавкаНДС, "Ставка");
		ТекДанные.Сумма 	= ТекДанные.Количество	* ТекДанные.Цена;
		ТекДанные.СуммаНДС	= Окр(ТекДанные.Сумма	* СтавкаНДС/(100 + СтавкаНДС), 2);
		
	КонецЦикла; 

КонецПроцедуры // УстановитьЦенуЗакупкиВСтрокеЗапасы()
	
// © Шишка В.В. [18 сентября 2023]  КОНЕЦ
//--------------------------------------------------------------------------

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	Оповестить("ЗапретРедактированияРасходныхНакладныхПоСтатусеТТН");
КонецПроцедуры

Процедура УстановкаФорматовЦен()
	КонстантыКоличествоЗнаковПослеЗапятойВЦене = Константы.КоличествоЗнаковПослеЗапятойВЦене.Получить();
	СтрокаФормата = "ЧДЦ="+КонстантыКоличествоЗнаковПослеЗапятойВЦене;
	Если КонстантыКоличествоЗнаковПослеЗапятойВЦене=0 Тогда
		СтрокаФормата = "ЧДЦ=2";
	КонецЕсли;
	Элементы.ТоварыЦена.Формат = НСтр("ru='"+СтрокаФормата+"';ka='"+СтрокаФормата+"'");
	Элементы.ТоварыЦена.ФорматРедактирования = НСтр("ru='"+СтрокаФормата+"';ka='"+СтрокаФормата+"'");
КонецПроцедуры
